sdaiValidateArrayNotOptional(Sdai_instS*,Sdai_Id_aggr*)
\details
Checks whether array instances whose array type declaration does not allow optional elements
have values at all index positions.
\param appInstance [in]  Identifier of the application instance to be validated.
\param list        [out] An identifier of a pre-existing NPL to which the SdaiAttr identifiers of
\returns sdaiTRUE if all instances of array items has not unset values, otherwise returns sdaiFALSE ;